<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Pandas for Exploratory Data Analysis

_Author: Kevin Markham (Washington, D.C.), Bryce Macher (Washington, D.C.)_

---

## Learning Objectives

- Define what Pandas is and how it relates to data science.
- Manipulate Pandas `DataFrames` and `Series`.
- Filter and sort data using Pandas.
- Manipulate `DataFrame` columns.
- Know how to handle null and missing values.

## Lesson Guide

- [What Is Pandas?](#pandas)
- [Reading Files, Selecting Columns, and Summarizing](#reading-files)
    - [Exercise 1](#exercise-one)
    
    
- [Filtering and Sorting](#filtering-and-sorting)
    - [Exercise 2](#exercise-two)
    
    
- [Renaming, Adding, and Removing Columns](#columns)
- [Handling Missing Values](#missing-values)
    - [Exercise 3](#exercise-three)
    
    
- [Split-Apply-Combine](#split-apply-combine)
    - [Exercise 4](#exercise-four)
    
    
- [Selecting Multiple Columns and Filtering Rows](#multiple-columns)
- [Joining (Merging) DataFrames](#joining-dataframes)
- [OPTIONAL: Other Commonly Used Features](#other-features)
- [OPTIONAL: Other Less Used Features of Pandas](#uncommon-features)
- [Summary](#summary)

In [1]:
x = list(range(0, 10, 2))
y = list(range(0, 10, 2))

In [2]:
x
y

[0, 2, 4, 6, 8]

In [3]:
x_column = list(enumerate(x))

In [4]:
x_column

[(0, 0), (1, 2), (2, 4), (3, 6), (4, 8)]

In [6]:
lst = [1, 'a', 3]

import numpy as np
lst = np.array([1, 'a', 3])

In [7]:
lst

array(['1', 'a', '3'], dtype='<U21')

<a id="pandas"></a>

## What Is Pandas?

- **Objective:** Define what Pandas is and how it relates to data science.

Pandas is a Python library that primarily adds two new datatypes to Python: `DataFrame` and `Series`.

- A `Series` is a sequence of items, where each item has a unique label (called an `index`).
- A `DataFrame` is a table of data. Each row has a unique label (the `row index`), and each column has a unique label (the `column index`).
- Note that each column in a `DataFrame` can be considered a `Series` (`Series` index).

> Behind the scenes, these datatypes use the NumPy ("Numerical Python") library. NumPy primarily adds the `ndarray` (n-dimensional array) datatype to Pandas. An `ndarray` is similar to a Python list â€” it stores ordered data. However, it differs in three respects:
> - Each element has the same datatype (typically fixed-size, e.g., a 32-bit integer).
> - Elements are stored contiguously (immediately after each other) in memory for fast retrieval.
> - The total size of an `ndarray` is fixed.

> Storing `Series` and `DataFrame` data in `ndarray`s makes Pandas faster and uses less memory than standard Python datatypes. Many libraries (such as scikit-learn) accept `ndarray`s as input rather than Pandas datatypes, so we will frequently convert between them.


### Using Pandas

Pandas is frequently used in data science because it offers a large set of commonly used functions, is relatively fast, and has a large community. Because many data science libraries also use NumPy to manipulate data, you can easily transfer data between libraries (as we will often do in this class!).

Pandas is a large library that typically takes a lot of practice to learn. It heavily overrides Python operators, resulting in odd-looking syntax. For example, given a `DataFrame` called `cars` which contains a column `mpg`, we might want to view all cars with mpg over 35. To do this, we might write: `cars[cars['mpg'] > 35]`. In standard Python, this would most likely give a syntax error. (**Challenge:** Using only built-in datatypes, can you define `cars` and `mpg` to make this expression valid?)

Pandas also highly favors certain patterns of use. For example, looping through a `DataFrame` row by row is highly discouraged. Instead, Pandas favors using **vectorized functions** that operate column by column. (This is because each column is stored separately as an `ndarray`, and NumPy is optimized for operating on `ndarray`s.)

Do not be discouraged if Pandas feels overwhelming. Gradually, as you use it, you will become familiar with which methods to use and the "Pandas way" of thinking about and manipulating data.

In [12]:
y_column = list(enumerate(y))

### Class Methods and Attributes

Pandas `DataFrame`s are Pandas class objects and therefore come with attributes and methods. To access these, follow the variable name with a dot. For example, given a `DataFrame` called `users`:

```
- users.index       # accesses the `index` attribute -- note there are no parentheses. attributes are not callable
- users.head()      # calls the `head` method (since there are open/closed parentheses)
- users.head(10)    # calls the `head` method with parameter `10`, indicating the first 10 rows. this is the same as:
- users.head(n=10)  # calls the `head` method, setting the named parameter `n` to have a value of `10`.
```

We know that the `head` method accepts one parameter with an optional name of `n` because it is in the documentation for that method. Let's see how to view the documentation next.

In [8]:
import pandas as pd

In [12]:
pd.read_csv?
# you can also use shift + tab on the method to show the help

### Viewing Documentation

There are a few ways to find more information about a method.

**Method 1:** In Jupyter, you can quickly view documentation for a method by following the method name by a `?`, as follows:

```
users.head?
```

> ```
Signature: users.head(n=5)
Docstring: Returns first n rows
```

Notice that we would normally invoke this method by calling `users.head(5)`. One quirk of IPython is that the `?` symbol must be the last character in the cell. Otherwise, it might not work.

> The `?` is a shortcut for the built-in Python function `help`, which returns the method's docstring. For example:
> ```
help(users.head)
```

**Method 2:** You can also search online for the phrase "`DataFrame head`", since you are calling the method `head` on the `users` object, which happens to be a `DataFrame`. (`type(users) => pandas.DataFrame`)

You can alternatively search online for `pandas head`, but be careful! `DataFrame` and `Series` both have a `head` method, so make sure you view the documentation for the correct one since they might be called differently. You will know you are looking at the correct documentation page because it will say `DataFrame.head` at the top, instead of `Series.head`.

## Pandas

In [1]:
# Load Pandas into Python
import pandas as pd #dataframes and series
from matplotlib import pyplot as plt #viz package - calls to a Matlab API
#import matplotlib.pyplot as plt

%matplotlib inline

In [2]:
# Quick aside - what is a magic function? Let's find out - Today we're going to spend a bit of time learning to use documentation
#try running this

%magic

#### Magic Functions in Jupyter

IPython (the jupyter shell) has a set of predefined â€˜magic functionsâ€™ that you can call with a command line style syntax. There are two kinds of magics, line-oriented and cell-oriented. Line magics are prefixed with the % character and work much like OS command-line calls: they get as an argument the rest of the line, where arguments are passed without parentheses or quotes. Cell magics are prefixed with a double %%, and they are functions that get as an argument not only the rest of the line, but also the lines below it in a separate argument.

[Learn More](https://ipython.readthedocs.io/en/stable/interactive/magics.html)

<a id="reading-files"></a>
### Reading Files, Selecting Columns, and Summarizing

In [59]:
#defines the object user, and imports our table to that object-space. 
# use ./... as a relative path. For example, here, we start from data folder in the pwd
users = pd.read_table('./data/user.tbl', sep = '|')

**Examine the users data.**

In [60]:
users # Print the first 30 and last 30 rows.

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [61]:
type(users)             # DataFrame

pandas.core.frame.DataFrame

In [62]:
users.head? # get description of this method. note that we should not include () after the method

SyntaxError: invalid syntax (<ipython-input-62-087f12214372>, line 1)

In [63]:
users.head()            # Print the first five rows.
users.tail()            # Print the last five rows.

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [64]:
users.head(n = 5)            # Print the first five rows.

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [65]:
users.sample?

In [66]:
 # The row index (aka "the row labels" â€” in this case integers)
users.index

RangeIndex(start=0, stop=943, step=1)

In [67]:
# Column names (which is "an index")
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [68]:
# Datatypes of each column â€” each column is stored as an ndarray, which has a datatype
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [69]:
# Number of rows and columns
users.shape

(943, 5)

In [30]:
#size = rows x columns
users.size

4715

In [22]:
# Concise summary (including memory usage) â€” useful to quickly see if nulls exist
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [32]:
#Attributes are plain "Tell me about yourself"
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

** Select or index data.**<br>
Pandas `DataFrame`s have structural similarities with Python-style lists and dictionaries.  
In the example below, we select a column of data using the name of the column in a similar manner to how we select a dictionary value with the dictionary key.

In [18]:
# Select a column â€” returns a Pandas Series (essentially an ndarray with an index)
# if we use single bracket ([]), we get series; if we use double bracket ([[]]), we get a dataframe
users['gender']

    gender
0        M
1        F
2        M
3        M
4        F
..     ...
938      F
939      M
940      M
941      F
942      M

[943 rows x 1 columns]

In [37]:
users.gender

0      M
1      F
2      M
3      M
4      F
      ..
938    F
939    M
940    M
941    F
942    M
Name: gender, Length: 943, dtype: object

In [19]:
users.iloc?

In [39]:
# DataFrame columns are Pandas Series.
type(users.gender)

pandas.core.series.Series

In [46]:
# Select one column using the DataFrame attribute.
users['gender']

# While a useful shorthand, these attributes only exist
# if the column name has no punctuations or spaces.

0      M
1      F
2      M
3      M
4      F
      ..
938    F
939    M
940    M
941    F
942    M
Name: gender, Length: 943, dtype: object

**Summarize (describe) the data.**<br>
Pandas has a bunch of built-in methods to quickly summarize your data and provide you with a quick general understanding.

In [51]:

# Describe all numeric columns.
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [33]:
# Describe all object columns (can include multiple types).
users.describe(include=['object'])

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

In [32]:
# Describe all columns, including non-numeric.
users.describe(include='all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

In [34]:
# Describe a single column â€” recall that "users.gender" refers to a Series.
users.gender.describe()

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

In [35]:
users['gender'].describe()

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

In [62]:
False == 0

True

In [64]:
# Calculate the mean of the ages.
users.gender.isnull().mean()

0.0

In [ ]:
users.occupation.value_counts()     # Most useful for categorical variables

In [65]:
users.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

## Exercise 1

In [40]:
# Read drinks.csv into a DataFrame called "drinks".
# Path to csv './data/drinks.csv'

drinks = pd.read_csv("./data/drinks.csv")

In [41]:
# Print the head and the tail.
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [42]:
# Examine the default index, datatypes, and shape. How many nulls?
#drinks.index
#drinks.datatypes
#drinks.shape
drinks.isnull().sum()

country                          0
beer_servings                    0
spirit_servings                  0
wine_servings                    0
total_litres_of_pure_alcohol     0
continent                       23
dtype: int64

In [43]:
# Print the beer_servings Series.
drinks["beer_servings"]

0        0
1       89
2       25
3      245
4      217
      ...
188    333
189    111
190      6
191     32
192     64
Name: beer_servings, Length: 193, dtype: int64

In [44]:
# Calculate the average beer_servings for the entire data set.
drinks["beer_servings"].mean()

106.16062176165804

In [45]:
# Count the number of occurrences of each "continent" value and see if it looks correct
drinks["continent"].value_counts()

AF    53
EU    45
AS    44
OC    16
SA    12
Name: continent, dtype: int64

<a id="filtering-and-sorting"></a>
### Filtering and Sorting
- **Objective:** Filter and sort data using Pandas.

We can use simple operator comparisons on columns to extract relevant or drop irrelevant information.

__Locational filtering__

.loc gets rows (or columns) with particular labels from the index. iloc gets rows (or columns) at particular positions in the index (so it only takes integers)

In [91]:
users.index

RangeIndex(start=0, stop=943, step=1)

In [90]:
# this gives us rows 2, 3, and not 4
users.iloc[2:4]

   user_id  age gender  occupation zip_code
2        3   23      M      writer    32067
3        4   24      M  technician    43537

In [93]:
# this gives all rows and columns 2 and 3 (not 4)
users.iloc[:, 2:4]

    gender     occupation
0        M     technician
1        F          other
2        M         writer
3        M     technician
4        F          other
..     ...            ...
938      F        student
939      M  administrator
940      M        student
941      F      librarian
942      M        student

[943 rows x 2 columns]

In [84]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [85]:
users.user_id.loc[5:7]

5    6
6    7
7    8
Name: user_id, dtype: int64

**Logical filtering: Only show users with age < 20.**

In [94]:
# Create a Series of Booleansâ€¦
# In Pandas, this comparison is performed element-wise on each row of data.
young_bool = users.age < 20
young_bool

0      False
1      False
2      False
3      False
4      False
       ...
938    False
939    False
940    False
941    False
942    False
Name: age, Length: 943, dtype: bool

In [61]:
# â€¦and use that Series to filter rows.
# In Pandas, indexing a DataFrame by a Series of Booleans only selects rows that are True in the Boolean.
users[users.age < 20]

     user_id  age gender occupation zip_code
29        30    7      M    student    55436
35        36   19      F    student    93117
51        52   18      F    student    55105
56        57   16      M       none    84010
66        67   17      M    student    60402
..       ...  ...    ...        ...      ...
871      872   19      F    student    74078
879      880   13      M    student    83702
886      887   14      F    student    27249
903      904   17      F    student    61073
924      925   18      F   salesman    49036

[77 rows x 5 columns]

In [97]:
users[users['age'] < 20]

     user_id  age gender occupation zip_code
29        30    7      M    student    55436
35        36   19      F    student    93117
51        52   18      F    student    55105
56        57   16      M       none    84010
66        67   17      M    student    60402
..       ...  ...    ...        ...      ...
871      872   19      F    student    74078
879      880   13      M    student    83702
886      887   14      F    student    27249
903      904   17      F    student    61073
924      925   18      F   salesman    49036

[77 rows x 5 columns]

In [101]:
# Or, combine into a single step.
users[users.age < 20]

     user_id  age gender occupation zip_code
29        30    7      M    student    55436
35        36   19      F    student    93117
51        52   18      F    student    55105
56        57   16      M       none    84010
66        67   17      M    student    60402
..       ...  ...    ...        ...      ...
871      872   19      F    student    74078
879      880   13      M    student    83702
886      887   14      F    student    27249
903      904   17      F    student    61073
924      925   18      F   salesman    49036

[77 rows x 5 columns]

In [104]:
# Important: This creates a view of the original DataFrame, not a new DataFrame.
# If you alter this view (e.g., by storing it in a variable and altering that)
# You will alter only the slice of the DataFrame and not the actual DataFrame itself
# Here, notice that Pandas gives you a SettingWithCopyWarning to alert you of this.

# It is best practice to use .loc and .iloc instead of the syntax below

users_under20 = users[users.age < 20].copy()  # To resolve this warning, copy the `DataFrame` using `.copy()`.
#users_under20

In [105]:
users_under20

     user_id  age gender occupation zip_code  newcolumn
29        30    7      M    student    55436          0
35        36   19      F    student    93117          0
51        52   18      F    student    55105          0
56        57   16      M       none    84010          0
66        67   17      M    student    60402          0
..       ...  ...    ...        ...      ...        ...
871      872   19      F    student    74078          0
879      880   13      M    student    83702          0
886      887   14      F    student    27249          0
903      904   17      F    student    61073          0
924      925   18      F   salesman    49036          0

[77 rows x 6 columns]

In [107]:
# Select one column from the filtered results.
users[users.age < 20]

29     M
35     F
51     F
56     M
66     M
      ..
871    F
879    M
886    F
903    F
924    F
Name: gender, Length: 77, dtype: object

In [108]:
# value_counts of resulting Series
users[users.age < 20].occupation.value_counts()

student          64
other             4
none              3
entertainment     2
writer            2
artist            1
salesman          1
Name: occupation, dtype: int64

**Logical filtering with multiple conditions**

In [110]:
# Ampersand for `AND` condition. (This is a "bitwise" `AND`.)
# Important: You MUST put parentheses around each expression because `&` has a higher precedence than `<`.
users[(users.age < 20) & (users.gender=='M')].occupation.value_counts()

student          37
other             3
none              3
entertainment     2
Name: occupation, dtype: int64

In [108]:
# Pipe for `OR` condition. (This is a "bitwise" `OR`.)
# Important: You MUST put parentheses around each expression because `|` has a higher precedence than `<`.
users[((users.age < 20) | (users.age > 60)) & (users.gender == 'M')].occupation.value_counts()

student          37
retired           7
other             4
none              3
engineer          3
entertainment     2
educator          2
doctor            1
librarian         1
salesman          1
administrator     1
healthcare        1
programmer        1
executive         1
Name: occupation, dtype: int64

In [109]:
student_retired = users[((users.age < 20) | (users.age > 60)) & (users.gender == 'M') & (users.occupation.isin(["student", "retired"]))]

In [111]:
student_retired.head()

     user_id  age gender occupation zip_code
29        30    7      M    student    55436
66        67   17      M    student    60402
67        68   19      M    student    22904
100      101   15      M    student    05146
105      106   61      M    retired    55125

In [62]:
# Preferred alternative to multiple `OR` conditions
user_doclaw = users[users.occupation.isin(['doctor', 'lawyer'])].copy()
user_doclaw['New Column']=user_doclaw.zip_code.str.startswith('2')
user_doclaw

     user_id  age gender occupation zip_code  New Column
9         10   53      M     lawyer    90703       False
124      125   30      M     lawyer    22202        True
125      126   28      F     lawyer    20015        True
137      138   46      M     doctor    53211       False
160      161   50      M     lawyer    55104       False
204      205   47      M     lawyer    06371       False
250      251   28      M     doctor    85032       False
298      299   29      M     doctor    63108       False
338      339   35      M     lawyer    37901       False
364      365   29      M     lawyer    20009        True
418      419   37      M     lawyer    43215       False
426      427   51      M     doctor    85258       False
443      444   51      F     lawyer    53202       False
588      589   21      M     lawyer    90034       False
679      680   33      M     lawyer    90405       False
840      841   45      M     doctor    47401       False
844      845   64      M     doctor    97405       False
845      846   27      M     lawyer    47130       False
934      935   42      M     doctor    66221       False

**Sorting**

In [113]:
# Sort a Series.
users['age'].sort_values()

29      7
470    10
288    11
879    13
608    13
       ..
584    69
766    70
802    70
859    70
480    73
Name: age, Length: 943, dtype: int64

In [115]:
# Sort a DataFrame by a single column.
users.sort_values('occupation')

     user_id  age gender     occupation zip_code
71        72   48      F  administrator    73034
767      768   29      M  administrator    12866
325      326   41      M  administrator    15235
856      857   35      F  administrator    V1G4L
88        89   43      F  administrator    68106
..       ...  ...    ...            ...      ...
263      264   36      F         writer    90064
490      491   43      F         writer    53711
497      498   26      M         writer    55408
389      390   42      F         writer    85016
832      833   34      M         writer    90019

[943 rows x 5 columns]

In [119]:
# Use descending order instead.
users.sort_values('age', ascending=False)

     user_id  age gender     occupation zip_code
480      481   73      M        retired    37771
802      803   70      M  administrator    78212
766      767   70      M       engineer    00000
859      860   70      F        retired    48322
584      585   69      M      librarian    98501
..       ...  ...    ...            ...      ...
879      880   13      M        student    83702
608      609   13      F        student    55106
288      289   11      M           none    94619
470      471   10      M        student    77459
29        30    7      M        student    55436

[943 rows x 5 columns]

In [116]:
# Sort by multiple columns.
users.sort_values(['occupation', 'age'])

     user_id  age gender     occupation zip_code
117      118   21      M  administrator    90210
179      180   22      F  administrator    60202
281      282   22      M  administrator    20057
316      317   22      M  administrator    13210
438      439   23      F  administrator    20817
..       ...  ...    ...            ...      ...
547      548   51      M         writer    95468
369      370   52      M         writer    08534
391      392   52      M         writer    59801
557      558   56      F         writer    63132
463      464   60      M         writer    94583

[943 rows x 5 columns]

<a id="exercise-two"></a>
### Exercise 2
Use the `drinks.csv` or `drinks` `DataFrame` from earlier to complete the following.

In [64]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [70]:
# Filter DataFrame to only include European countries.
drinks[drinks.continent == 'EU']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
1,Albania,89,132,54,4.9,EU
3,Andorra,245,138,312,12.4,EU
7,Armenia,21,179,11,3.8,EU
9,Austria,279,75,191,9.7,EU
10,Azerbaijan,21,46,5,1.3,EU
15,Belarus,142,373,42,14.4,EU
16,Belgium,295,84,212,10.5,EU
21,Bosnia-Herzegovina,76,173,8,4.6,EU
25,Bulgaria,231,252,94,10.3,EU
42,Croatia,230,87,254,10.2,EU
44,Cyprus,192,154,113,8.2,EU
45,Czech Republic,361,170,134,11.8,EU
48,Denmark,224,81,278,10.4,EU
57,Estonia,224,194,59,9.5,EU
60,Finland,263,133,97,10.0,EU
61,France,127,151,370,11.8,EU
64,Georgia,52,100,149,5.4,EU
65,Germany,346,117,175,11.3,EU
67,Greece,133,112,218,8.3,EU
75,Hungary,234,215,185,11.3,EU
76,Iceland,233,61,78,6.6,EU
81,Ireland,313,118,165,11.4,EU
83,Italy,85,42,237,6.5,EU
93,Latvia,281,216,62,10.5,EU
98,Lithuania,343,244,56,12.9,EU
99,Luxembourg,236,133,271,11.4,EU
105,Malta,149,100,120,6.6,EU
111,Monaco,0,0,0,0.0,EU
113,Montenegro,31,114,128,4.9,EU
120,Netherlands,251,88,190,9.4,EU
126,Norway,169,71,129,6.7,EU
135,Poland,343,215,56,10.9,EU
136,Portugal,194,67,339,11.0,EU
139,Moldova,109,226,18,6.3,EU
140,Romania,297,122,167,10.4,EU
147,San Marino,0,0,0,0.0,EU
151,Serbia,283,131,127,9.6,EU
155,Slovakia,196,293,116,11.4,EU
156,Slovenia,270,51,276,10.6,EU
160,Spain,284,157,112,10.0,EU
165,Sweden,152,60,186,7.2,EU
166,Switzerland,185,100,280,10.2,EU
170,Macedonia,106,27,86,3.9,EU
180,Ukraine,206,237,45,8.9,EU
182,United Kingdom,219,126,195,10.4,EU

In [73]:
# Filter DataFrame to only include European countries with wine_servings > 300.
drinks[(drinks.continent == 'EU') & (drinks.wine_servings >300)]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
3,Andorra,245,138,312,12.4,EU
61,France,127,151,370,11.8,EU
136,Portugal,194,67,339,11.0,EU

In [74]:
# Calculate the average beer_servings for all of Europe.
drinks[drinks.continent == 'EU'].beer_servings.mean()

193.77777777777777

In [87]:
# Determine which 10 countries have the highest total_litres_of_pure_alcohol.
drinks.sort_values(by = ['total_litres_of_pure_alcohol'],ascending = False).head(10).iloc[:,[0,4]]

                country  total_litres_of_pure_alcohol
15              Belarus                          14.4
98            Lithuania                          12.9
3               Andorra                          12.4
68              Grenada                          11.9
45       Czech Republic                          11.8
61               France                          11.8
141  Russian Federation                          11.5
81              Ireland                          11.4
155            Slovakia                          11.4
99           Luxembourg                          11.4

<a id="columns"></a>
### Renaming, Adding, and Removing Columns

- **Objective:** Manipulate `DataFrame` columns.

In [141]:
drinks.rename(columns = {'beer_servings': 'beer', 'wine_servings': 'wine'})

,country,beer,spirit_servings,wine,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [144]:
drinks.head()

,country,beer,spirit_servings,wine,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [143]:
# Rename one or more columns in a single output using value mapping.
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'}, inplace = True)

In [159]:
# Replace all column names using a list of matching length.
drink_cols = ['country', 'beer', 'spirit', 'wine', 'liters', 'continent'] 

# Replace during file reading (disables the header from the file).
drinks = pd.read_csv('./data/drinks.csv', header=0, names=drink_cols)

In [140]:
# Replace after file has already been read into Python.
drinks.columns = drink_cols

In [149]:
drinks.columns

Index(['country', 'beer', 'spirit', 'wine', 'liters', 'continent'], dtype='object')

**Easy Column Operations**<br>
Rather than having to reference indexes and create for loops to do column-wise operations, Pandas is smart and knows that when we add columns together we want to add the values in each row together.

In [161]:
# Add a new column as a function of existing columns.
drinks['servings'] = drinks.beer + drinks.spirit + drinks.wine
drinks['mL'] = drinks.liters * 1000

drinks.head()

       country  beer  spirit  wine  liters continent  servings       mL
0  Afghanistan     0       0     0     0.0        AS         0      0.0
1      Albania    89     132    54     4.9        EU       275   4900.0
2      Algeria    25       0    14     0.7        AF        39    700.0
3      Andorra   245     138   312    12.4        EU       695  12400.0
4       Angola   217      57    45     5.9        AF       319   5900.0

**Removing Columns**

In [151]:
# axis=0 for rows, 1 for columns
drinks.drop('mL', axis=1)

         country  beer  spirit  wine  liters continent  servings
0    Afghanistan     0       0     0     0.0        AS         0
1        Albania    89     132    54     4.9        EU       275
2        Algeria    25       0    14     0.7        AF        39
3        Andorra   245     138   312    12.4        EU       695
4         Angola   217      57    45     5.9        AF       319
..           ...   ...     ...   ...     ...       ...       ...
188    Venezuela   333     100     3     7.7        SA       436
189      Vietnam   111       2     1     2.0        AS       114
190        Yemen     6       0     0     0.1        AS         6
191       Zambia    32      19     4     2.5        AF        55
192     Zimbabwe    64      18     4     4.7        AF        86

[193 rows x 7 columns]

In [152]:
drinks.head()

       country  beer  spirit  wine  liters continent  servings       mL
0  Afghanistan     0       0     0     0.0        AS         0      0.0
1      Albania    89     132    54     4.9        EU       275   4900.0
2      Algeria    25       0    14     0.7        AF        39    700.0
3      Andorra   245     138   312    12.4        EU       695  12400.0
4       Angola   217      57    45     5.9        AF       319   5900.0

In [153]:
# Drop multiple columns.
drinks.drop(['mL', 'servings'], axis=1)

         country  beer  spirit  wine  liters continent
0    Afghanistan     0       0     0     0.0        AS
1        Albania    89     132    54     4.9        EU
2        Algeria    25       0    14     0.7        AF
3        Andorra   245     138   312    12.4        EU
4         Angola   217      57    45     5.9        AF
..           ...   ...     ...   ...     ...       ...
188    Venezuela   333     100     3     7.7        SA
189      Vietnam   111       2     1     2.0        AS
190        Yemen     6       0     0     0.1        AS
191       Zambia    32      19     4     2.5        AF
192     Zimbabwe    64      18     4     4.7        AF

[193 rows x 6 columns]

In [154]:
drinks.head()

       country  beer  spirit  wine  liters continent  servings       mL
0  Afghanistan     0       0     0     0.0        AS         0      0.0
1      Albania    89     132    54     4.9        EU       275   4900.0
2      Algeria    25       0    14     0.7        AF        39    700.0
3      Andorra   245     138   312    12.4        EU       695  12400.0
4       Angola   217      57    45     5.9        AF       319   5900.0

In [156]:
# Drop on the original DataFrame rather than returning a new one.
drinks.drop(['mL', 'servings'], axis=1, inplace=True, )

In [162]:
drinks.drop(columns = ['mL', 'servings'], inplace = True)

<a id="missing-values"></a>
### Handling Missing Values

- **Objective:** Know how to handle null and missing values.

Sometimes, values will be missing from the source data or as a byproduct of manipulations. It is very important to detect missing data. Missing data can:

- Make the entire row ineligible to be training data for a model.
- Hint at data-collection errors.
- Indicate improper conversion or manipulation.
- Actually not be missing â€” it sometimes means "zero," "false," "not applicable," or "entered an empty string."

For example, a `.csv` file might have a missing value in some data fields:

```
tool_name,material,cost
hammer,wood,8
chainsaw,,
wrench,metal,5
```

When this data is imported, "null" values will be stored in the second row (in the "material" and "cost" columns).

> In Pandas, a "null" value is either `None` or `np.NaN` (Not a Number). Many fixed-size numeric datatypes (such as integers) do not have a way of representing `np.NaN`. So, numeric columns will be promoted to floating-point datatypes that do support it. For example, when importing the `.csv` file above:

> - **For the second row:** `None` will be stored in the "material" column and `np.NaN` will be stored in the "cost" column. The entire "cost" column (stored as a single `ndarray`) must be stored as floating-point values to accommodate the `np.NaN`, even though an integer `8` is in the first row.

In [154]:
# Missing values are usually excluded in calculations by default.
drinks.continent.value_counts()              # Excludes missing values in the calculation

AF    53
EU    45
AS    44
NA    23
OC    16
SA    12
Name: continent, dtype: int64

In [155]:
# Includes missing values
drinks.continent.value_counts(dropna=False)

AF    53
EU    45
AS    44
NA    23
OC    16
SA    12
Name: continent, dtype: int64

In [156]:
# Find missing values in a Series.
# True if missing, False if not missing
drinks.continent.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
188    False
189    False
190    False
191    False
192    False
Name: continent, Length: 193, dtype: bool

In [157]:
# Count the missing values â€” sum() works because True is 1 and False is 0.
drinks.continent.isnull().sum()

0

In [158]:
# True if not missing, False if missing
drinks.continent.notnull()

0      True
1      True
2      True
3      True
4      True
       ...
188    True
189    True
190    True
191    True
192    True
Name: continent, Length: 193, dtype: bool

**Understanding Pandas Axis**

In [163]:
# Sums "down" the 0 axis (rows) â€” so, we get the sums of each column
drinks.sum(axis=0)

country    AfghanistanAlbaniaAlgeriaAndorraAngolaAntigua ...
beer                                                   20489
spirit                                                 15632
wine                                                    9544
liters                                                 910.4
dtype: object

In [165]:
# axis=0 is the default.
drinks.sum(axis = 1)

0        0.0
1      279.9
2       39.7
3      707.4
4      324.9
       ...
188    443.7
189    116.0
190      6.1
191     57.5
192     90.7
Length: 193, dtype: float64

In [166]:
# Sums "across" the 1 axis (columns) â€” so, we get the sums of numeric values in the row (beer+spirit+wine+liters+â€¦)
drinks['meaningless'] = drinks.sum(axis=1)

In [167]:
drinks.dtypes

country         object
beer             int64
spirit           int64
wine             int64
liters         float64
continent       object
meaningless    float64
dtype: object

**Find missing values in a `DataFrame`.**

In [172]:
# DataFrame of Booleans
drinks.isnull()

     country   beer  spirit   wine  liters  continent  meaningless
0      False  False   False  False   False      False        False
1      False  False   False  False   False      False        False
2      False  False   False  False   False      False        False
3      False  False   False  False   False      False        False
4      False  False   False  False   False      False        False
..       ...    ...     ...    ...     ...        ...          ...
188    False  False   False  False   False      False        False
189    False  False   False  False   False      False        False
190    False  False   False  False   False      False        False
191    False  False   False  False   False      False        False
192    False  False   False  False   False      False        False

[193 rows x 7 columns]

**Dropping Missing Values**

In [174]:
# Drop a row if ANY values are missing from any column â€” can be dangerous!
drinks.dropna()

         country  beer  spirit  wine  liters continent  meaningless
0    Afghanistan     0       0     0     0.0        AS          0.0
1        Albania    89     132    54     4.9        EU        279.9
2        Algeria    25       0    14     0.7        AF         39.7
3        Andorra   245     138   312    12.4        EU        707.4
4         Angola   217      57    45     5.9        AF        324.9
..           ...   ...     ...   ...     ...       ...          ...
188    Venezuela   333     100     3     7.7        SA        443.7
189      Vietnam   111       2     1     2.0        AS        116.0
190        Yemen     6       0     0     0.1        AS          6.1
191       Zambia    32      19     4     2.5        AF         57.5
192     Zimbabwe    64      18     4     4.7        AF         90.7

[193 rows x 7 columns]

In [175]:
# Drop a row only if ALL values are missing.
drinks.dropna(how='all')

         country  beer  spirit  wine  liters continent  meaningless
0    Afghanistan     0       0     0     0.0        AS          0.0
1        Albania    89     132    54     4.9        EU        279.9
2        Algeria    25       0    14     0.7        AF         39.7
3        Andorra   245     138   312    12.4        EU        707.4
4         Angola   217      57    45     5.9        AF        324.9
..           ...   ...     ...   ...     ...       ...          ...
188    Venezuela   333     100     3     7.7        SA        443.7
189      Vietnam   111       2     1     2.0        AS        116.0
190        Yemen     6       0     0     0.1        AS          6.1
191       Zambia    32      19     4     2.5        AF         57.5
192     Zimbabwe    64      18     4     4.7        AF         90.7

[193 rows x 7 columns]

In [169]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country      193 non-null    object
 1   beer         193 non-null    int64
 2   spirit       193 non-null    int64
 3   wine         193 non-null    int64
 4   liters       193 non-null    float64
 5   continent    170 non-null    object
 6   meaningless  193 non-null    float64
dtypes: float64(2), int64(3), object(2)
memory usage: 10.7+ KB

In [170]:
drinks.continent.value_counts()

AF    53
EU    45
AS    44
OC    16
SA    12
Name: continent, dtype: int64

**Filling Missing Values**<br>
You may have noticed that the continent North America (NA) does not appear in the `continent` column. Pandas read in the original data and saw "NA", thought it was a missing value, and converted it to a `NaN`, missing value.

In [ ]:
# Fill in missing values with "NA" â€” this is dangerous to do without manually verifying them!
drinks.continent.fillna(value='NA')

In [ ]:
# Modifies "drinks" in-place
drinks.continent.fillna(value='NA', inplace=True)

In [ ]:
drinks

In [171]:
# Turn off the missing value filter â€” this is a better approach!
drinks = pd.read_csv('./data/drinks.csv', header=0, names=drink_cols, na_filter=False)

In [173]:
drinks.continent.value_counts()

AF    53
EU    45
AS    44
NA    23
OC    16
SA    12
Name: continent, dtype: int64

<a id="exercise-three"></a>
### Exercise 3

In [186]:
# Read ufo.csv into a DataFrame called "ufo".
ufo_data = './data/ufo.csv'

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80543 entries, 0 to 80542
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             80496 non-null  object
 1   Colors Reported  17034 non-null  object
 2   Shape Reported   72141 non-null  object
 3   State            80543 non-null  object
 4   Time             80543 non-null  object
dtypes: object(5)
memory usage: 3.1+ MB

In [187]:
# Check the shape of the DataFrame.

(80543, 5)

In [188]:
# What are the three most common colors reported?

ORANGE    5216
RED       4809
GREEN     1897
Name: Colors Reported, dtype: int64

In [189]:
# Rename any columns with spaces so that they don't contain spaces.

In [190]:
#Checking your work is a great step

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [197]:
# For reports in VA, what's the most common city?

Virginia Beach    110
Name: City, dtype: int64

In [192]:
# Print a DataFrame containing only reports from Arlington, VA.

            City Colors_Reported Shape_Reported State              Time
202    Arlington           GREEN           OVAL    VA   7/13/1952 21:00
6300   Arlington             NaN        CHEVRON    VA    5/5/1990 21:40
10278  Arlington             NaN           DISK    VA   5/27/1997 15:30
14527  Arlington             NaN          OTHER    VA   9/10/1999 21:41
17984  Arlington             RED           DISK    VA  11/19/2000 22:00
21201  Arlington           GREEN       FIREBALL    VA    1/7/2002 17:45
22633  Arlington             NaN          LIGHT    VA    7/26/2002 1:15
22780  Arlington             NaN          LIGHT    VA    8/7/2002 21:00
25066  Arlington             NaN          CIGAR    VA    6/1/2003 22:34
27398  Arlington             NaN        VARIOUS    VA   12/13/2003 2:00
30608  Arlington             NaN         CIRCLE    VA   10/9/2004 22:30
31316  Arlington             NaN      FORMATION    VA   12/13/2004 0:30
35787  Arlington             NaN          LIGHT    VA   3/15/2006 22:30
37036  Arlington             NaN       TRIANGLE    VA    8/1/2006 22:00
39673  Arlington             NaN          LIGHT    VA    4/7/2007 18:45
41083  Arlington             NaN          FLASH    VA    8/15/2007 1:30
44562  Arlington             NaN       TRIANGLE    VA    6/6/2008 21:55
45450  Arlington             NaN           OVAL    VA    8/2/2008 20:30
48679  Arlington             NaN         SPHERE    VA   4/24/2009 17:45
54613  Arlington             NaN          LIGHT    VA   9/17/2010 19:00
54944  Arlington             NaN         SPHERE    VA  10/12/2010 19:00
70462  Arlington             NaN       FIREBALL    VA   6/25/2013 23:00
72856  Arlington             RED         SPHERE    VA   9/26/2013 21:20
73408  Arlington             NaN         CIRCLE    VA   10/19/2013 0:17
73747  Arlington             NaN          LIGHT    VA   11/1/2013 22:42
76144  Arlington             NaN          CIGAR    VA   2/21/2014 14:30
76325  Arlington             NaN            NaN    VA    3/1/2014 20:00
76337  Arlington             NaN      FORMATION    VA    3/1/2014 23:30
77807  Arlington      RED ORANGE          LIGHT    VA   5/24/2014 22:30
79122  Arlington             NaN         CIRCLE    VA    7/7/2014 21:00

In [194]:
# Count the number of missing values in each column.

City                  47
Colors_Reported    63509
Shape_Reported      8402
State                  0
Time                   0
dtype: int64

In [195]:
# How many rows remain if you drop all rows with any missing values?

15510

(80543, 5)

In [196]:
# How many rows did we lose by removing all rows with any missing values?

65033

<a id="split-apply-combine"></a>
### Split-Apply-Combine

Split-apply-combine is a pattern for analyzing data. Suppose we want to find mean beer consumption per country. Then:

- **Split:** We group data by continent.
- **Apply:** For each group, we apply the `mean()` function to find the average beer consumption.
- **Combine:** We now combine the continent names with the `mean()`s to produce a summary of our findings.

In [55]:
# For each continent, calculate the mean beer servings.
drinks
drinks.groupby(['continent'])['beer_servings'].mean()
# you can get is as a DF by usig [[]]
drinks.groupby(['continent'])[['beer_servings']].mean()

           beer_servings
continent
AF             61.471698
AS             37.045455
EU            193.777778
OC             89.687500
SA            175.083333

In [51]:
# For each continent, calculate the mean of all numeric columns. T for transpose
drinks.groupby('continent').mean().T

continent,AF,AS,EU,OC,SA
beer_servings,61.471698,37.045455,193.777778,89.68750,175.083333
spirit_servings,16.339623,60.840909,132.555556,58.43750,114.750000
wine_servings,16.264151,9.068182,142.222222,35.62500,62.416667
total_litres_of_pure_alcohol,3.007547,2.170455,8.617778,3.38125,6.308333

In [53]:
# For each continent, describe beer servings.
drinks.groupby(['continent']).beer_servings.describe().T

continent          AF          AS          EU          OC          SA
count       53.000000   44.000000   45.000000   16.000000   12.000000
mean        61.471698   37.045455  193.777778   89.687500  175.083333
std         80.557816   49.469725   99.631569   96.641412   65.242845
min          0.000000    0.000000    0.000000    0.000000   93.000000
25%         15.000000    4.250000  127.000000   21.000000  129.500000
50%         32.000000   17.500000  219.000000   52.500000  162.500000
75%         76.000000   60.500000  270.000000  125.750000  198.000000
max        376.000000  247.000000  361.000000  306.000000  333.000000

In [56]:
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [57]:
# Similar, but outputs a DataFrame and can be customized â€” "agg" allows you to aggregate results of Series functions
#drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max'])
drinks.groupby('continent').agg({'beer_servings':['mean','median'],'wine_servings':'max'})
#drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max']).sort_values('mean')

          beer_servings        wine_servings
                   mean median           max
continent
AF            61.471698   32.0           233
AS            37.045455   17.5           123
EU           193.777778  219.0           370
OC            89.687500   52.5           212
SA           175.083333  162.5           221

In [187]:
# For each continent, describe all numeric columns.
drinks.groupby('continent').describe()

           beer                                                             \
          count        mean        std   min     25%    50%     75%    max
continent
AF         53.0   61.471698  80.557816   0.0   15.00   32.0   76.00  376.0
AS         44.0   37.045455  49.469725   0.0    4.25   17.5   60.50  247.0
EU         45.0  193.777778  99.631569   0.0  127.00  219.0  270.00  361.0
NA         23.0  145.434783  79.621163   1.0   80.00  143.0  198.00  285.0
OC         16.0   89.687500  96.641412   0.0   21.00   52.5  125.75  306.0
SA         12.0  175.083333  65.242845  93.0  129.50  162.5  198.00  333.0

          spirit              ...  liters       meaningless              \
           count        mean  ...     75%   max       count        mean
continent                     ...
AF          53.0   16.339623  ...   4.700   9.1        53.0   97.083019
AS          44.0   60.840909  ...   2.425  11.5        44.0  109.125000
EU          45.0  132.555556  ...  10.900  14.4        45.0  477.173333
NA          23.0  165.739130  ...   7.000  11.9        23.0  341.691304
OC          16.0   58.437500  ...   6.150  10.4        16.0  187.131250
SA          12.0  114.750000  ...   7.375   8.3        12.0  358.558333


                  std    min     25%     50%      75%    max
continent
AF         115.748113    0.0   21.80   52.10   98.700  512.9
AS         135.167526    0.0    6.10   69.20  138.175  657.5
EU         180.203705    0.0  375.60  550.60  607.400  707.4
NA         136.846450  125.2  245.30  355.30  403.000  676.9
OC         178.786904    0.0   57.75  100.25  350.150  555.4
SA          83.449053  219.8  299.75  389.85  418.300  447.3

[6 rows x 40 columns]

In [188]:
# For each continent, count the number of rows.
print((drinks.groupby('continent').continent.count()))
print((drinks.continent.value_counts()))   # should be the same

continent
AF    53
AS    44
EU    45
NA    23
OC    16
SA    12
Name: continent, dtype: int64
AF    53
EU    45
AS    44
NA    23
OC    16
SA    12
Name: continent, dtype: int64

<a id="exercise-four"></a>
### Exercise 4

Use the "users" `DataFrame` or "users" file in the Data folder to complete the following.

In [ ]:
#show the head

In [70]:
users

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [73]:
# For each occupation in "users", count the number of occurrences.
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [74]:
# For each occupation, calculate the mean age.
users.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [76]:
# For each occupation, calculate the minimum and maximum ages.
users.groupby('occupation').agg({'age':['min','max']})

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

In [77]:
# For each combination of occupation and gender, calculate the mean age.
users.groupby(['occupation','gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

<a id="multiple-columns"></a>
### Selecting Multiple Columns and Filtering Rows

In [213]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [212]:
# Select multiple columns â€” yet another overload of the DataFrame indexing operator!
my_cols = ['City', 'State']     # Create a list of column names...
ufo[my_cols]                    # ...and use that list to select columns.

                       City State
0                    Ithaca    NY
1               Willingboro    NJ
2                   Holyoke    CO
3                   Abilene    KS
4      New York Worlds Fair    NY
...                     ...   ...
80538                Neligh    NE
80539          Uhrichsville    OH
80540                Tucson    AZ
80541           Orland park    IL
80542              Loughman    FL

[80543 rows x 2 columns]

In [192]:
# Or, combine into a single step (this is a Python list inside of the Python index operator!).
ufo[['City', 'State']]

                       City State
0                    Ithaca    NY
1               Willingboro    NJ
2                   Holyoke    CO
3                   Abilene    KS
4      New York Worlds Fair    NY
...                     ...   ...
80538                Neligh    NE
80539          Uhrichsville    OH
80540                Tucson    AZ
80541           Orland park    IL
80542              Loughman    FL

[80543 rows x 2 columns]

<a id="joining-dataframes"></a>
### Joining (Merging) `DataFrames`

In [214]:
#import pandas as pd
movie_cols = ['movie_id', 'title']
movies_filename = './data/movies.tbl'

movies = pd.read_table(movies_filename, sep='|', header=None, names=movie_cols, usecols=[0, 1], encoding='latin1')
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [215]:
rating_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings_filename = './data/movie_ratings.tsv'

ratings = pd.read_table(ratings_filename, sep='\t', header=None, names=rating_cols)
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [216]:
# Merge "movies" and "ratings" (inner join on "movie_id").
movie_ratings = pd.merge(movies, ratings)
movie_ratings.head()

   movie_id             title  user_id  rating  timestamp
0         1  Toy Story (1995)      308       4  887736532
1         1  Toy Story (1995)      287       5  875334088
2         1  Toy Story (1995)      148       4  877019411
3         1  Toy Story (1995)      280       4  891700426
4         1  Toy Story (1995)       66       3  883601324

<a id="other-features"></a>
### OPTIONAL: Other Commonly Used Features

In [78]:
# Apply an arbitrary function to each value of a Pandas column, storing the result in a new column.
users['under30'] = users.age.apply(lambda age: age < 30)
users.head()

   user_id  age gender  occupation zip_code  under30
0        1   24      M  technician    85711     True
1        2   53      F       other    94043    False
2        3   23      M      writer    32067     True
3        4   24      M  technician    43537     True
4        5   33      F       other    15213    False

In [ ]:
# Apply an arbitrary function to each row of a DataFrame, storing the result in a new column.
#  (Remember that, by default, axis=0. Since we want to go row by row, we set axis=1.)

users['under30male'] = users.apply(lambda row: row.age < 30 and row.gender == 'M', axis=1)

In [ ]:
# Map existing values to a different set of values.
users['is_male'] = users.gender.map({'F':0, 'M':1})

In [ ]:
users.head()

In [ ]:
# Replace all instances of a value in a column (must match entire value).
ufo.State.replace('Fl', 'FL', inplace=True)

In [ ]:
# String methods are accessed via "str".
ufo.State.str.upper()                               # Converts to upper case
# checks for a substring
ufo['Colors'].str.contains('RED', na='False')

In [ ]:
ufo['Time'] = pd.to_datetime(ufo.Time)
ufo.dtypes

In [ ]:
# Convert a string to the datetime format (this is often slow â€” consider doing it in the "read_csv()" method.)
ufo['Time'] = pd.to_datetime(ufo.Time)
ufo.Time.dt.hour                        # Datetime format exposes convenient attributes
(ufo.Time.max() - ufo.Time.min()).days  # Also allows you to do datetime "math"

In [ ]:
# Set and then remove an index.
ufo.set_index('Time', inplace=True)

In [ ]:
ufo.index

In [ ]:
# Change the datatype of a column.
drinks['beer'] = drinks.beer.astype('float')

In [ ]:
# Create dummy variables for "continent" and exclude first dummy column.
continent_dummies = pd.get_dummies(drinks.continent, prefix='cont').iloc[:, 1:]
continent_dummies.head()

In [ ]:
# Concatenate two DataFrames (axis=0 for rows, axis=1 for columns).
drinks = pd.concat([drinks, continent_dummies], axis=1)

<a id="uncommon-features"></a>
### OPTIONAL: Other Less-Used Features of Pandas

In [ ]:
# Detecting duplicate rows
users.duplicated()          # True if a row is identical to a previous row
users.duplicated().sum()    # Count of duplicates
users[users.duplicated()]   # Only show duplicates
users.drop_duplicates()     # Drop duplicate rows
users.age.duplicated()      # Check a single column for duplicates
users.duplicated(['age', 'gender', 'zip_code']).sum()   # Specify columns for finding duplicates

In [ ]:
# Convert a range of values into descriptive groups.
drinks['beer_level'] = 'low'    # Initially set all values to "low"
drinks.loc[drinks.beer.between(101, 200), 'beer_level'] = 'med'     # Change 101-200 to "med"
drinks.loc[drinks.beer.between(201, 400), 'beer_level'] = 'high'    # Change 201-400 to "high"

In [ ]:
# Display a cross-tabulation of two Series.
pd.crosstab(drinks.continent, drinks.beer_level)

In [ ]:
# Convert "beer_level" into the "category" datatype.
drinks['beer_level'] = pd.Categorical(drinks.beer_level, categories=['low', 'med', 'high'])
drinks.sort_values('beer_level')   # Sorts by the categorical ordering (low to high)

In [ ]:
# Limit which rows are read when reading in a file â€” useful for large files!
pd.read_csv('./data/drinks.csv', nrows=10)           # Only read first 10 rows
pd.read_csv('./data/drinks.csv', skiprows=[1, 2])    # Skip the first two rows of data

In [ ]:
# Write a DataFrame out to a .csv
drinks.to_csv('drinks_updated.csv')                 # Index is used as first column
drinks.to_csv('drinks_updated.csv', index=False)    # Ignore index

In [ ]:
# Create a DataFrame from a dictionary.
pd.DataFrame({'capital':['Montgomery', 'Juneau', 'Phoenix'], 'state':['AL', 'AK', 'AZ']})

In [ ]:
# Create a DataFrame from a list of lists.
pd.DataFrame([['Montgomery', 'AL'], ['Juneau', 'AK'], ['Phoenix', 'AZ']], columns=['capital', 'state'])

In [ ]:
# Randomly sample a DataFrame.
import NumPy as np
mask = np.random.rand(len(drinks)) < 0.66   # Create a Series of Booleans
train = drinks[mask]                        # Will contain around 66% of the rows
test = drinks[~mask]                        # Will contain the remaining rows

In [ ]:
# Change the maximum number of rows and columns printed ('None' means unlimited).
pd.set_option('max_rows', None)     # Default is 60 rows
pd.set_option('max_columns', None)  # Default is 20 columns
print(drinks)

In [ ]:
# Reset options to defaults.
pd.reset_option('max_rows')
pd.reset_option('max_columns')

In [ ]:
# Change the options temporarily (settings are restored when you exit the "with" block).
with pd.option_context('max_rows', None, 'max_columns', None):
    print(drinks)

<a id="summary"></a>
### Summary

Believe it or not, we've only barely touched the surface of everything that Pandas offers. Don't worry if you don't remember most of it â€” for now, just knowing what exists is key. Remember that the more you use Pandas to manipulate data, the more of these functions you will take interest in, look up, and remember.

In this notebook, the most important things to familiarize yourself with are the basics:
- Manipulating `DataFrames` and `Series`
- Filtering columns and rows
- Handling missing values
- Split-apply-combine (this one takes some practice!)